/** Цей файл визначає основні типи та поведінку для цього модуля */
package com.epam.rd.autocode.spring.project.model.enums;

/**
 * Перелік (enum), який визначає мову книги
 * Використовується для класифікації книг за мовою
 */
public enum Language {

    // Англійська мова
    ENGLISH,

    // Німецька мова
    GERMAN,

    // Французька мова
    FRENCH,

    // Іспанська мова
    SPANISH,

    // Японська мова
    JAPANESE,

    // Українська мова
    UKRAINIAN,

    // Інша мова (якщо не входить у список)
    OTHER
}